In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/Users/farhanrashid/Downloads/USA_Housing.csv')

In [4]:
print(df.loc[1])

Avg. Area Income                                                     79248.642455
Avg. Area House Age                                                        6.0029
Avg. Area Number of Rooms                                                6.730821
Avg. Area Number of Bedrooms                                                 3.09
Area Population                                                      40173.072174
Price                                                              1505890.914847
Address                         188 Johnson Views Suite 079\nLake Kathleen, CA...
Name: 1, dtype: object

In [6]:
df.shape

(5000, 7)

In [9]:
X = df.drop(['Area Population','Avg. Area Income', 'Price'], axis=1)

In [10]:
X.head(10)

,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Address
0,5.682861,7.009188,4.09,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,6.002900,6.730821,3.09,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,5.865890,8.512727,5.13,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,7.188236,5.586729,3.26,USS Barnett\nFPO AP 44820
4,5.040555,7.839388,4.23,USNS Raymond\nFPO AE 09386
5,4.988408,6.104512,4.04,"06039 Jennifer Islands Apt. 443\nTracyport, KS..."
6,6.025336,8.147760,3.41,"4759 Daniel Shoals Suite 442\nNguyenburgh, CO ..."
7,6.989780,6.620478,2.42,"972 Joyce Viaduct\nLake William, TN 17778-6483"
8,5.362126,6.393121,2.30,USS Gilbert\nFPO AA 20957
9,4.423672,8.167688,6.10,Unit 9446 Box 0958\nDPO AE 97025

In [17]:
X.shape

(5000, 4)

In [11]:
Y= df['Price']

In [15]:
Y.head(10)

0    1.059034e+06
1    1.505891e+06
2    1.058988e+06
3    1.260617e+06
4    6.309435e+05
5    1.068138e+06
6    1.502056e+06
7    1.573937e+06
8    7.988695e+05
9    1.545155e+06
Name: Price, dtype: float64

In [16]:
Y.shape

(5000,)

In [18]:
#Exercise 2##

In [19]:
df_2 = pd.read_csv('/Users/farhanrashid/Downloads/Banking_Marketing.csv')

In [20]:
df_2.shape

(41199, 21)

In [21]:
df_2.dtypes

age               float64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
month              object
day_of_week        object
duration          float64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp_var_rate      float64
cons_price_idx    float64
cons_conf_idx     float64
euribor3m         float64
nr_employed       float64
y                   int64
dtype: object

In [22]:
missing_values = df_2.isnull().sum()
print(missing_values)

age               2
job               0
marital           0
education         0
default           0
housing           0
loan              0
contact           6
month             0
day_of_week       0
duration          7
campaign          0
pdays             0
previous          0
poutcome          0
emp_var_rate      0
cons_price_idx    0
cons_conf_idx     0
euribor3m         0
nr_employed       0
y                 0
dtype: int64

In [23]:

missing_percentage = df_2.isnull().mean() * 100
print(missing_percentage)

age               0.004854
job               0.000000
marital           0.000000
education         0.000000
default           0.000000
housing           0.000000
loan              0.000000
contact           0.014563
month             0.000000
day_of_week       0.000000
duration          0.016991
campaign          0.000000
pdays             0.000000
previous          0.000000
poutcome          0.000000
emp_var_rate      0.000000
cons_price_idx    0.000000
cons_conf_idx     0.000000
euribor3m         0.000000
nr_employed       0.000000
y                 0.000000
dtype: float64

In [37]:
cleaned_df = df_2.dropna()
df.dropna(inplace=True)

cleaned_df.head(5)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y
0,44.0,blue-collar,married,basic.4y,unknown,yes,no,cellular,aug,thu,...,1,999,0,nonexistent,1.4,93.444,-36.1,4.963,5228.1,0
1,53.0,technician,married,unknown,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-0.1,93.200,-42.0,4.021,5195.8,0
2,28.0,management,single,university.degree,no,yes,no,cellular,jun,thu,...,3,6,2,success,-1.7,94.055,-39.8,0.729,4991.6,1
3,39.0,services,married,high.school,no,no,no,cellular,apr,fri,...,2,999,0,nonexistent,-1.8,93.075,-47.1,1.405,5099.1,0
4,55.0,retired,married,basic.4y,no,yes,no,cellular,aug,fri,...,1,3,1,success,-2.9,92.201,-31.4,0.869,5076.2,1

In [38]:

missing_values_left =cleaned_df.isnull().any().any()

print("Are there any missing values left in the dataset?", missing_values_left)

Are there any missing values left in the dataset? False

In [26]:
##Everytime we dont need to remove the missing values. 
#Because without removing the values we can just simply put the mean or average value of the column 
#in order to have some kind of efficient analysis or modeling.

In [39]:
age_mean = cleaned_df['age'].mean()
print(age_mean)

40.02537208342438

In [42]:

cleaned_df['age'].fillna(age_mean)

0         44.0
1         53.0
2         28.0
3         39.0
4         55.0
         ...
41182     24.0
41183     59.0
41184     31.0
41187     25.0
41194    104.0
Name: age, Length: 41187, dtype: float64

In [43]:
duration_median = cleaned_df['duration'].median()
print(duration_median)

180.0

In [44]:
cleaned_df['duration'].fillna(duration_median)

0        210.0
1        138.0
2        339.0
3        185.0
4        137.0
         ...
41182    118.0
41183    222.0
41184    196.0
41187    112.0
41194    222.0
Name: duration, Length: 41187, dtype: float64

In [46]:
contact_mode = cleaned_df['contact'].mode()[0]
print(contact_mode)

cellular

In [47]:
df['contact'] = cleaned_df['contact'].fillna(contact_mode)